tests/ThermophysicalTransportModels/waterFilmHTC/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (  0.0000   0.0000 -900.0) //  0
    (224.7858   9.8144 -900.0) //  1
    (224.7858  -9.8144 -900.0) //  2
    
    (  0.0000   0.0000 -400.0) //  3
    (224.7858   9.8144 -400.0) //  4
    (224.7858  -9.8144 -400.0) //  5
    
    (  0.0000   0.0000  -70.0) //  6
    (224.7858   9.8144  -70.0) //  7
    (224.7858  -9.8144  -70.0) //  8
    
    (  0.0000   0.0000  -40.0) //  9
    (224.7858   9.8144  -40.0) // 10
    (224.7858  -9.8144  -40.0) // 11
    
    (  0.0000   0.0000  -10.0) // 12
    (224.7858   9.8144  -10.0) // 13
    (224.7858  -9.8144  -10.0) // 14
    
    (  0.0000   0.0000    0.0) // 15
    (224.7858   9.8144    0.0) // 16
    (224.7858  -9.8144    0.0) // 17
);

blocks
(
    hex ( 0  2  1  0  3  5  4  3) domain (40 1  50) simpleGrading (0.5 1 0.7) //  0
    hex ( 3  5  4  3  6  8  7  6) domain (40 1 165) simpleGrading (0.5 1 1.0) //  1
    hex ( 6  8  7  6  9 11 10  9) domain (40 1  15) simpleGrading (0.5 1 1.0) //  2
    hex ( 9 11 10  9 12 14 13 12) domain (40 1  15) simpleGrading (0.5 1 1.0) //  3
    hex (12 14 13 12 15 17 16 15) domain (40 1   5) simpleGrading (0.5 1 1.0) //  4
);

edges
(
    arc  1  2 (225.0000  0.0000 -900.0)
    arc  4  5 (225.0000  0.0000 -400.0)
    arc  7  8 (225.0000  0.0000  -70.0)
    arc 10 11 (225.0000  0.0000  -40.0)
    arc 13 14 (225.0000  0.0000  -10.0)
    arc 16 17 (225.0000  0.0000    0.0)
);

boundary
(
    water-film
    {
        type wall;
        faces
        (
            ( 1  2  5  4)
            ( 4  5  8  7)
        );
    }

    air-gap
    {
        type wall;
        faces
        (
            ( 7  8 11 10)
        );
    }

    mould
    {
        type wall;
        faces
        (
            (10 11 14 13)
        );
    }

    hot-top
    {
        type wall;
        faces
        (
            (13 14 17 16)
        );
    }

    ram
    {
        type patch;
        faces
        (
            ( 0  2  1  0)
        );
    }

    free-surface
    {
        type patch;
        faces
        (
            (15 17 16 15)
        );
    }

    axis
    {
        type empty;
        faces
        (
            ( 3  0  0  3)
            ( 6  3  3  6)
            ( 9  6  6  9)
            (12  9  9 12)
            (15 12 12 15)
        );
    }

    symmetry_planes
    {
        type symmetry;
        faces
        (
            ( 0  1  4  3)
            ( 5  2  0  3)
            ( 3  4  7  6)
            ( 8  5  3  6)
            ( 6  7 10  9)
            (11  8  6  9)
            ( 9 10 13 12)
            (14 11  9 12)
            (12 13 16 15)
            (17 14 12 15)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //

