tests/ThermophysicalTransportModels/waterFilmHTC/case/constant/HTC_Tw
(
    (273.0000 252601.47616)
    (276.9196 235567.08985)
    (280.8392 219175.99378)
    (284.7588 203428.85890)
    (288.6784 188326.50789)
    (292.5980 173869.96068)
    (296.5176 160060.49727)
    (300.4372 146899.74630)
    (304.3568 134389.81241)
    (308.2764 122533.46387)
    (312.1960 111334.41647)
    (316.1156 100797.77696)
    (320.0352 90930.76102)
    (323.9548 81743.90724)
    (327.8744 73253.23889)
    (331.7940 65484.36553)
    (335.7136 58480.91292)
    (339.6332 52323.74684)
    (343.5528 47181.49005)
    (347.4724 43473.88850)
    (351.3920 42616.58715)
    (355.3116 54280.95511)
    (359.2312 -35023.56316)
    (363.1508 6666.65559)
    (367.0704 10358.72239)
    (370.9899 11027.95470)
    (374.9095 11220.84665)
    (378.8291 11567.11031)
    (382.7487 12297.53354)
    (386.6683 13516.68893)
    (390.5879 15278.83814)
    (394.5075 17614.93981)
    (398.4271 20543.94624)
    (402.3467 24078.10932)
    (406.2663 28225.70114)
    (410.1859 32992.50860)
    (414.1055 38382.70145)
    (418.0251 44399.36035)
    (421.9447 51044.81059)
    (425.8643 58320.84027)
    (429.7839 66228.84696)
    (433.7035 74769.93877)
    (437.6231 83945.00564)
    (441.5427 93754.77048)
    (445.4623 104199.82660)
    (449.3819 115280.66554)
    (453.3015 126997.69797)
    (457.2211 139351.26965)
    (461.1407 152341.67380)
    (465.0603 165969.16069)
    (468.9799 180233.94525)
    (472.8995 195136.21305)
    (476.8191 210676.12520)
    (480.7387 226853.82223)
    (484.6583 243669.42726)
    (488.5779 261123.04864)
    (492.4975 279214.78208)
    (496.4171 297944.71245)
    (500.3367 317312.91528)
    (504.2563 337319.45800)
    (508.1759 357964.40099)
    (512.0955 379247.79851)
    (516.0151 401169.69941)
    (519.9347 423730.14782)
    (523.8543 446929.18370)
    (527.7739 470766.84333)
    (531.6935 495243.15970)
    (535.6131 520358.16289)
    (539.5327 546111.88039)
    (543.4523 572504.33735)
    (547.3719 599535.55686)
    (551.2915 627205.56012)
    (555.2111 655514.36666)
    (559.1307 684461.99446)
    (563.0503 714048.46016)
    (566.9698 744273.77913)
    (570.8894 775137.96561)
    (574.8090 806641.03281)
    (578.7286 838782.99301)
    (582.6482 871563.85763)
    (586.5678 904983.63731)
    (590.4874 939042.34195)
    (594.4070 973739.98082)
    (598.3266 1009076.56257)
    (602.2462 1045052.09531)
    (606.1658 1081666.58662)
    (610.0854 1118920.04362)
    (614.0050 1156812.47299)
    (617.9246 1195343.88101)
    (621.8442 1234514.27358)
    (625.7638 1274323.65626)
    (629.6834 1314772.03429)
    (633.6030 1355859.41261)
    (637.5226 1397585.79588)
    (641.4422 1439951.18851)
    (645.3618 1482955.59466)
    (649.2814 1526599.01827)
    (653.2010 1570881.46307)
    (657.1206 1615802.93260)
    (661.0402 1661363.43022)
    (664.9598 1707562.95910)
    (668.8794 1754401.52226)
    (672.7990 1801879.12257)
    (676.7186 1849995.76277)
    (680.6382 1898751.44545)
    (684.5578 1948146.17309)
    (688.4774 1998179.94803)
    (692.3970 2048852.77252)
    (696.3166 2100164.64871)
    (700.2362 2152115.57863)
    (704.1558 2204705.56423)
    (708.0754 2257934.60739)
    (711.9950 2311802.70987)
    (715.9146 2366309.87338)
    (719.8342 2421456.09954)
    (723.7538 2477241.38992)
    (727.6734 2533665.74601)
    (731.5930 2590729.16924)
    (735.5126 2648431.66098)
    (739.4322 2706773.22254)
    (743.3518 2765753.85518)
    (747.2714 2825373.56011)
    (751.1910 2885632.33850)
    (755.1106 2946530.19146)
    (759.0302 3008067.12006)
    (762.9497 3070243.12534)
    (766.8693 3133058.20828)
    (770.7889 3196512.36983)
    (774.7085 3260605.61092)
    (778.6281 3325337.93243)
    (782.5477 3390709.33521)
    (786.4673 3456719.82008)
    (790.3869 3523369.38782)
    (794.3065 3590658.03921)
    (798.2261 3658585.77496)
    (802.1457 3727152.59581)
    (806.0653 3796358.50241)
    (809.9849 3866203.49545)
    (813.9045 3936687.57555)
    (817.8241 4007810.74332)
    (821.7437 4079572.99937)
    (825.6633 4151974.34427)
    (829.5829 4225014.77858)
    (833.5025 4298694.30282)
    (837.4221 4373012.91753)
    (841.3417 4447970.62320)
    (845.2613 4523567.42032)
    (849.1809 4599803.30937)
    (853.1005 4676678.29079)
    (857.0201 4754192.36504)
    (860.9397 4832345.53253)
    (864.8593 4911137.79368)
    (868.7789 4990569.14891)
    (872.6985 5070639.59858)
    (876.6181 5151349.14309)
    (880.5377 5232697.78281)
    (884.4573 5314685.51807)
    (888.3769 5397312.34924)
    (892.2965 5480578.27665)
    (896.2161 5564483.30062)
    (900.1357 5649027.42147)
    (904.0553 5734210.63950)
    (907.9749 5820032.95502)
    (911.8945 5906494.36831)
    (915.8141 5993594.87966)
    (919.7337 6081334.48933)
    (923.6533 6169713.19760)
    (927.5729 6258731.00473)
    (931.4925 6348387.91096)
    (935.4121 6438683.91654)
    (939.3317 6529619.02171)
    (943.2513 6621193.22670)
    (947.1709 6713406.53173)
    (951.0905 6806258.93704)
    (955.0101 6899750.44282)
    (958.9296 6993881.04929)
    (962.8492 7088650.75666)
    (966.7688 7184059.56511)
    (970.6884 7280107.47485)
    (974.6080 7376794.48606)
    (978.5276 7474120.59892)
    (982.4472 7572085.81362)
    (986.3668 7670690.13032)
    (990.2864 7769933.54920)
    (994.2060 7869816.07041)
    (998.1256 7970337.69413)
    (1002.0452 8071498.42052)
    (1005.9648 8173298.24971)
    (1009.8844 8275737.18187)
    (1013.8040 8378815.21714)
    (1017.7236 8482532.35567)
    (1021.6432 8586888.59759)
    (1025.5628 8691883.94304)
    (1029.4824 8797518.39215)
    (1033.4020 8903791.94505)
    (1037.3216 9010704.60188)
    (1041.2412 9118256.36275)
    (1045.1608 9226447.22778)
    (1049.0804 9335277.19710)
    (1053.0000 9444746.27082)
)